// 都道府県データ
const PREFECTURES_DATA = [
  {
    "id": 1,
    "name": "北海道",
    "lat": 43.064615,
    "lng": 141.346807,
    "region": "北海道"
  },
  {
    "id": 2,
    "name": "青森県",
    "lat": 40.824308,
    "lng": 140.739998,
    "region": "東北"
  },
  {
    "id": 3,
    "name": "岩手県",
    "lat": 39.703619,
    "lng": 141.152684,
    "region": "東北"
  },
  {
    "id": 4,
    "name": "宮城県",
    "lat": 38.268837,
    "lng": 140.872103,
    "region": "東北"
  },
  {
    "id": 5,
    "name": "秋田県",
    "lat": 39.718614,
    "lng": 140.102364,
    "region": "東北"
  },
  {
    "id": 6,
    "name": "山形県",
    "lat": 38.240436,
    "lng": 140.363633,
    "region": "東北"
  },
  {
    "id": 7,
    "name": "福島県",
    "lat": 37.750299,
    "lng": 140.467551,
    "region": "東北"
  },
  {
    "id": 8,
    "name": "茨城県",
    "lat": 36.341811,
    "lng": 140.446793,
    "region": "関東"
  },
  {
    "id": 9,
    "name": "栃木県",
    "lat": 36.565725,
    "lng": 139.883565,
    "region": "関東"
  },
  {
    "id": 10,
    "name": "群馬県",
    "lat": 36.390668,
    "lng": 139.060406,
    "region": "関東"
  },
  {
    "id": 11,
    "name": "埼玉県",
    "lat": 35.856999,
    "lng": 139.648849,
    "region": "関東"
  },
  {
    "id": 12,
    "name": "千葉県",
    "lat": 35.605057,
    "lng": 140.123306,
    "region": "関東"
  },
  {
    "id": 13,
    "name": "東京都",
    "lat": 35.689487,
    "lng": 139.691706,
    "region": "関東"
  },
  {
    "id": 14,
    "name": "神奈川県",
    "lat": 35.447507,
    "lng": 139.642345,
    "region": "関東"
  },
  {
    "id": 15,
    "name": "新潟県",
    "lat": 37.902418,
    "lng": 139.023221,
    "region": "中部"
  },
  {
    "id": 16,
    "name": "富山県",
    "lat": 36.695291,
    "lng": 137.211338,
    "region": "中部"
  },
  {
    "id": 17,
    "name": "石川県",
    "lat": 36.594682,
    "lng": 136.625573,
    "region": "中部"
  },
  {
    "id": 18,
    "name": "福井県",
    "lat": 36.065219,
    "lng": 136.221640,
    "region": "中部"
  },
  {
    "id": 19,
    "name": "山梨県",
    "lat": 35.664158,
    "lng": 138.568449,
    "region": "中部"
  },
  {
    "id": 20,
    "name": "長野県",
    "lat": 36.651299,
    "lng": 138.181239,
    "region": "中部"
  },
  {
    "id": 21,
    "name": "岐阜県",
    "lat": 35.391227,
    "lng": 136.722291,
    "region": "中部"
  },
  {
    "id": 22,
    "name": "静岡県",
    "lat": 34.976987,
    "lng": 138.383084,
    "region": "中部"
  },
  {
    "id": 23,
    "name": "愛知県",
    "lat": 35.180188,
    "lng": 136.906565,
    "region": "中部"
  },
  {
    "id": 24,
    "name": "三重県",
    "lat": 34.730283,
    "lng": 136.508588,
    "region": "近畿"
  },
  {
    "id": 25,
    "name": "滋賀県",
    "lat": 35.004531,
    "lng": 135.868585,
    "region": "近畿"
  },
  {
    "id": 26,
    "name": "京都府",
    "lat": 35.021247,
    "lng": 135.755597,
    "region": "近畿"
  },
  {
    "id": 27,
    "name": "大阪府",
    "lat": 34.686297,
    "lng": 135.519661,
    "region": "近畿"
  },
  {
    "id": 28,
    "name": "兵庫県",
    "lat": 34.691269,
    "lng": 135.183071,
    "region": "近畿"
  },
  {
    "id": 29,
    "name": "奈良県",
    "lat": 34.685334,
    "lng": 135.832745,
    "region": "近畿"
  },
  {
    "id": 30,
    "name": "和歌山県",
    "lat": 34.225987,
    "lng": 135.167509,
    "region": "近畿"
  },
  {
    "id": 31,
    "name": "鳥取県",
    "lat": 35.503891,
    "lng": 134.238258,
    "region": "中国"
  },
  {
    "id": 32,
    "name": "島根県",
    "lat": 35.472295,
    "lng": 133.050510,
    "region": "中国"
  },
  {
    "id": 33,
    "name": "岡山県",
    "lat": 34.661751,
    "lng": 133.934406,
    "region": "中国"
  },
  {
    "id": 34,
    "name": "広島県",
    "lat": 34.396033,
    "lng": 132.459595,
    "region": "中国"
  },
  {
    "id": 35,
    "name": "山口県",
    "lat": 34.185956,
    "lng": 131.470649,
    "region": "中国"
  },
  {
    "id": 36,
    "name": "徳島県",
    "lat": 34.065718,
    "lng": 134.559296,
    "region": "四国"
  },
  {
    "id": 37,
    "name": "香川県",
    "lat": 34.340149,
    "lng": 134.043444,
    "region": "四国"
  },
  {
    "id": 38,
    "name": "愛媛県",
    "lat": 33.841624,
    "lng": 132.765681,
    "region": "四国"
  },
  {
    "id": 39,
    "name": "高知県",
    "lat": 33.559706,
    "lng": 133.531079,
    "region": "四国"
  },
  {
    "id": 40,
    "name": "福岡県",
    "lat": 33.606576,
    "lng": 130.418297,
    "region": "九州"
  },
  {
    "id": 41,
    "name": "佐賀県",
    "lat": 33.249442,
    "lng": 130.299794,
    "region": "九州"
  },
  {
    "id": 42,
    "name": "長崎県",
    "lat": 32.744839,
    "lng": 129.873756,
    "region": "九州"
  },
  {
    "id": 43,
    "name": "熊本県",
    "lat": 32.789827,
    "lng": 130.741667,
    "region": "九州"
  },
  {
    "id": 44,
    "name": "大分県",
    "lat": 33.238172,
    "lng": 131.612619,
    "region": "九州"
  },
  {
    "id": 45,
    "name": "宮崎県",
    "lat": 31.911096,
    "lng": 131.423855,
    "region": "九州"
  },
  {
    "id": 46,
    "name": "鹿児島県",
    "lat": 31.560146,
    "lng": 130.557978,
    "region": "九州"
  },
  {
    "id": 47,
    "name": "沖縄県",
    "lat": 26.212401,
    "lng": 127.680932,
    "region": "沖縄"
  }
];
